[
    {
        "title": "R50 - MINI Hatch",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlccjUwLmpwZw==",
        "imageAlt": "R50 Mini in Black",
        "description": "The R50 MINI Hatch, also known as the first generation MINI Cooper, was introduced in 2001 by BMW Group, which had acquired the British car manufacturer in 1994. The MINI Hatch is a compact car that offers a unique blend of style, performance, and practicality. It is powered by a range of petrol and diesel engines, ranging from a 1.4-liter to a 1.6-liter, delivering up to 215 hp in the John Cooper Works version. The MINI Hatch also features a distinctive retro-inspired design, a spacious and high-quality interior, and a nimble and responsive driving experience. The R50 MINI Hatch was produced until 2006 when it was succeeded by the R56 model.",
        "chasisCode": "R50",
        "year": "2001 - 2006",
        "trimLevel": "One, Cooper"
    },
    {
        "title": "R52 - MINI Convertible",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlccjUyLmpwZWc=",
        "imageAlt": "R52 Mini in British Racing Green",
        "description": "The R52 MINI is the second generation of the MINI Convertible, introduced in 2004 by BMW Group. It is based on the R50 MINI Hatch but with a retractable soft-top roof that opens in just 15 seconds. The R52 MINI is powered by a range of petrol and diesel engines, ranging from a 1.6-liter to a 1.6-liter supercharged, delivering up to 215 hp in the John Cooper Works version. The MINI Convertible also features a distinctive retro-inspired design, a spacious and high-quality interior, and a fun and engaging driving experience. The R52 MINI was produced until 2008 when it was succeeded by the R57 model."
    },
    {
        "title": "R53 - MINI Hatch",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlccjUzLmpwZw==",
        "imageAlt": "R53 Mini in White",
        "description": "The R53 MINI is the first generation of the MINI Cooper S, introduced in 2002 by BMW Group. The R53 model is based on the R50 MINI Hatch but with a more powerful engine, a sport-tuned suspension, and sporty exterior styling. The MINI Cooper S is powered by a supercharged 1.6-liter engine, delivering up to 215 hp, and can accelerate from 0-60 mph in just 6.4 seconds. The R53 MINI also features a high-quality interior with unique styling touches, and a fun and engaging driving experience. The R53 MINI was produced until 2006 when it was succeeded by the R56 model."
    },





    {
        "title": "R55 - MINI Clubman",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlccjU1LmpwZw==",
        "imageAlt": "R55 Mini in Black",
        "description": "The R55 MINI is the Clubman version of the second-generation MINI, introduced in 2007 by BMW Group. The R55 model is based on the R56 MINI but with a longer wheelbase and a unique rear door design, with two side-hinged doors that swing open to provide easier access to the cargo area. The MINI Clubman is powered by a range of petrol and diesel engines, ranging from a 1.6-liter to a 1.6-liter turbocharged, delivering up to 211 hp in the John Cooper Works version. The R55 MINI also features a distinctive retro-inspired design, a high-quality interior, and a fun and engaging driving experience. The R55 MINI was produced until 2014 when it was succeeded by the F54 model."
    },
    {
        "title": "R56 - MINI Hatch",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlccjU2LmpwZw==",
        "imageAlt": "R56 Mini in Red",
        "description": "The R56 MINI is the second generation of the MINI Hatch, introduced in 2006 by BMW Group. The R56 model is based on the R50 MINI but with a refreshed design and updated technology. The MINI Hatch is powered by a range of petrol and diesel engines, ranging from a 1.4-liter to a 1.6-liter turbocharged, delivering up to 211 hp in the John Cooper Works version. The R56 MINI also features a high-quality interior with improved ergonomics and technology, and a fun and engaging driving experience. The R56 MINI was produced until 2013 when it was succeeded by the F56 model."
    },
    {
        "title": "R57 - MINI Convertible",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlccjU3LmpwZw==",
        "imageAlt": "R57 Mini in Red",
        "description": "The R57 MINI is the convertible version of the second-generation MINI, introduced in 2009 by BMW Group. The R57 model is based on the R56 MINI but with a retractable soft-top roof that opens in just 15 seconds. The MINI Convertible is powered by a range of petrol and diesel engines, ranging from a 1.6-liter to a 1.6-liter turbocharged, delivering up to 211 hp in the John Cooper Works version. The R57 MINI also features a high-quality interior with unique styling touches and updated technology, and a fun and engaging driving experience. The R57 MINI was produced until 2015 when it was succeeded by the F57 model."
    },
    {
        "title": "R58 - MINI Coupe",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlccjU4LmpwZw==",
        "imageAlt": "R58 Mini in Silver",
        "description": "The R58 MINI is the Coupe version of the second-generation MINI, introduced in 2011 by BMW Group. The R58 model is based on the R56 MINI but with a sleeker two-door coupe body style. The MINI Coupe is powered by a range of petrol and diesel engines, ranging from a 1.6-liter to a 1.6-liter turbocharged, delivering up to 211 hp in the John Cooper Works version. The R58 MINI also features a high-quality interior with unique styling touches and updated technology, and a fun and engaging driving experience. The R58 MINI was produced until 2015 when it was succeeded by the F56-based MINI Cooper 2-door Hardtop."
    },
    {
        "title": "R59 - MINI Roadster",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlccjU5LmpwZw==",
        "imageAlt": "R59 Mini in Silver",
        "description": "The R59 MINI is the Roadster version of the second-generation MINI, introduced in 2012 by BMW Group. The R59 model is based on the R58 MINI Coupe but with a retractable soft-top roof that opens in just 10 seconds. The MINI Roadster is powered by a range of petrol and diesel engines, ranging from a 1.6-liter to a 1.6-liter turbocharged, delivering up to 211 hp in the John Cooper Works version. The R59 MINI also features a high-quality interior with unique styling touches and updated technology, and a fun and engaging driving experience. The R59 MINI was produced until 2015 when it was succeeded by the F56-based MINI Cooper Convertible."
    },
    {
        "title": "R60 - MINI Countryman",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlccjYwLmpwZw==",
        "imageAlt": "R60 Mini in White",
        "description": "The R60 MINI is the Countryman version of the second-generation MINI, introduced in 2010 by BMW Group. The R60 model is the first MINI to feature a four-door body style, and it offers more space and practicality than any other MINI. The MINI Countryman is powered by a range of petrol and diesel engines, ranging from a 1.6-liter to a 1.6-liter turbocharged, delivering up to 218 hp in the John Cooper Works version. The R60 MINI also features a high-quality interior with unique styling touches and updated technology, and a fun and engaging driving experience. The R60 MINI was produced until 2017 when it was succeeded by the F60 model."
    },
    {
        "title": "R61 - MINI Paceman",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlccjYxLmpwZWc=",
        "imageAlt": "R61 Mini in Black",
        "description": "The R61 MINI is the Paceman version of the second-generation MINI, introduced in 2012 by BMW Group. The R61 model is based on the Countryman but with a sportier two-door body style, and it offers a more dynamic and engaging driving experience. The MINI Paceman is powered by a range of petrol and diesel engines, ranging from a 1.6-liter to a 1.6-liter turbocharged, delivering up to 218 hp in the John Cooper Works version. The R61 MINI also features a high-quality interior with unique styling touches and updated technology, and a range of customization options to make it truly your own. The R61 MINI was produced until 2016 when it was succeeded by the F60-based MINI Countryman."
    },






    {
        "title": "F54 - MINI Clubman",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlcZjU0LmpwZw==",
        "imageAlt": "F54 Mini in Deep Blue",
        "description": "The F54 MINI is the Clubman version of the third-generation MINI, introduced in 2015 by BMW Group. The F54 model features a longer wheelbase than the standard MINI Hatch, providing more interior space and a more comfortable ride. The MINI Clubman is powered by a range of petrol and diesel engines, ranging from a 1.5-liter to a 2.0-liter turbocharged, delivering up to 306 hp in the John Cooper Works version. The F54 MINI also features a high-quality interior with unique styling touches and updated technology, and a range of practicality features like a split rear door and ample storage space. The F54 MINI is a versatile and stylish option for those seeking a premium compact car with plenty of personality."
    },
    {
        "title": "F55 - MINI Hatch (5 Door)",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlcZjU1LmpwZw==",
        "imageAlt": "F55 Mini in White",
        "description": "The F55 MINI is the 5-door Hatch version of the third-generation MINI, introduced in 2014 by BMW Group. The F55 model features a longer wheelbase than the 3-door Hatch, providing more interior space and a more comfortable ride. The MINI 5-door Hatch is powered by a range of petrol and diesel engines, ranging from a 1.5-liter to a 2.0-liter turbocharged, delivering up to 306 hp in the John Cooper Works version. The F55 MINI also features a high-quality interior with unique styling touches and updated technology, and a range of practicality features like a split rear door and ample storage space. The F55 MINI is a great option for those seeking a premium compact car with added practicality."
    },
    {
        "title": "F56 - MINI Hatch",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlcZjU2LmpwZw==",
        "imageAlt": "F56 Mini in British Racing Green",
        "description": "The F56 MINI is the 3-door Hatch version of the third-generation MINI, introduced in 2014 by BMW Group. The F56 model features a sleek and modern design, with an updated front grille and LED headlights. The MINI 3-door Hatch is powered by a range of petrol and diesel engines, ranging from a 1.5-liter to a 2.0-liter turbocharged, delivering up to 306 hp in the John Cooper Works version. The F56 MINI also features a high-quality interior with unique styling touches and updated technology, and a fun and engaging driving experience. The F56 MINI is a stylish and sporty option for those seeking a premium compact car with plenty of personality."
    },
    {
        "title": "F57 - MINI Convertible",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlcZjU3LmpwZw==",
        "imageAlt": "R57 Mini in Red",
        "description": "The F57 MINI is the Convertible version of the third-generation MINI, introduced in 2016 by BMW Group. The F57 model features a retractable soft-top roof, which can be opened or closed in just 18 seconds, even while driving at speeds up to 30 mph. The MINI Convertible is powered by a range of petrol and diesel engines, ranging from a 1.5-liter to a 2.0-liter turbocharged, delivering up to 306 hp in the John Cooper Works version. The F57 MINI also features a high-quality interior with unique styling touches and updated technology, and a fun and engaging driving experience with the wind in your hair. The F57 MINI is a stylish and versatile option for those seeking a premium compact convertible with plenty of personality."
    },
    {
        "title": "F60 - MINI Countryman",
        "image": "aW1hZ2VzXG1vZGVybm1pbmlcZjYwLmpwZw==",
        "imageAlt": "F60 Mini in Light Blue",
        "description": "The F60 MINI is the Countryman version of the third-generation MINI, introduced in 2017 by BMW Group. The F60 model features a more rugged and muscular design, with an increased ride height and available all-wheel drive for improved off-road capability. The MINI Countryman is powered by a range of petrol and diesel engines, ranging from a 1.5-liter to a 2.0-liter turbocharged, delivering up to 306 hp in the John Cooper Works version. The F60 MINI also features a high-quality interior with unique styling touches and updated technology, and a range of practicality features like a split rear door and ample storage space. The F60 MINI is a versatile and capable option for those seeking a premium compact SUV with plenty of personality."
    }
]